#Тимофей обычно спит ночью XX часов и устраивает себе днем тихий час на YY минут.
#Определите, сколько всего минут Тимофей спит в сутки.

a=int(input())
b=int(input())
print(a*60+b)
